{"id":31341,"date":"2021-01-22T16:41:32","date_gmt":"2021-01-22T21:41:32","guid":{"rendered":"https:\/\/avocadu.com\/?page_id=31341"},"modified":"2022-06-07T17:38:37","modified_gmt":"2022-06-07T21:38:37","slug":"accessibility","status":"publish","type":"page","link":"https:\/\/avocadu.com\/accessibility\/","title":{"rendered":"Accessibility Statement"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\"><strong>General<\/strong><\/h2>\n\n\n\n<p>Access to any company’s website can be challenging for persons having certain disabilities.&nbsp;A person’s disability is often unique. What may work well for one person, may cause difficulties for another person.&nbsp; Our company has made efforts to accommodate as many of our customers and potential customers as is reasonable given our size, resources, and knowledge of our customers, and potential customer’s needs. To that end we have engaged the services of professionals to assist and advise us in these matters.&nbsp; More general information about website access and website access statements can be found at <span style=\"text-decoration: underline;\"><a href=\"https:\/\/www.karlinlaw.com\/accessibility-statements-for-websites\/\" target=\"_blank\" rel=\"noreferrer noopener\">AccessibilityStatements.com<\/a><\/span> and at <span style=\"text-decoration: underline;\"><a href=\"http:\/\/Karlinlaw.com\/Accessibility-Statements-for-Websites.shtml\" target=\"_blank\" rel=\"noreferrer noopener\">Karlinlaw.com\/Accessibility-Statements-for-Websites.shtml<\/a><\/span>.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Accessibility on this Website<\/strong><\/h2>\n\n\n\n<p>Our website provides several methods, features, and policies that can help with access to our website and\/or to products or services provided or referred to on our website or by our business.&nbsp;&nbsp;<\/p>\n\n\n\n<p>There are also various aids available by third parties and which are provided by most browsers. A general discussion of these aids can be found on several websites, including <span style=\"text-decoration: underline;\"><a href=\"https:\/\/www.karlinlaw.com\/accessibility-statements-for-websites\/\" target=\"_blank\" rel=\"noreferrer noopener\">AssessibilityStatements.com<\/a><\/span>  and at <span style=\"text-decoration: underline;\"><a href=\"https:\/\/www.karlinlaw.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Karlinlaw.com<\/a><\/span>.<\/p>\n\n\n\n<p>If you are having difficulty with access to our website even after utilizing any access features within this website and\/or any third party or browser features, we invite you to contact us for further assistance.&nbsp; Contact information is set forth below.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Some Specific Accessibility Features within this website.<\/strong><\/h3>\n\n\n\n<p>This website contains a third-party plugin, also known as a Widget, called UserWay Website Accessibility (“UserWay”), which is powered by this third party’s dedicated accessibility server.&nbsp; Use of this Widget can improve website accessibility for some users, particularly related to certain types of disabilities. UserWay has stated that its application makes efforts to follow to some degree the Web Content Accessibility Guidelines (WCAG 2.1). &nbsp; On our website, the UserWay widget is located in the lower-right corner of most pages.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Enabling the Accessibility Menu<\/strong><\/h4>\n\n\n\n<p>The accessibility menu can be enabled by clicking the accessibility menu icon that appears after clicking on the Widget described above. After triggering the accessibility menu, please wait a moment for the accessibility menu to load in its entirety.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Disclaimer<\/strong><\/h4>\n\n\n\n<p>We anticipate that from time to time, within our resources, we will be making modifications to parts of our website, and possibly modifications to accessibility of our website. Reasonable efforts toward improving seamless, accessible, and unhindered use of websites by customers and potential customers is generally a worthwhile goal.&nbsp; Moving closer to this goal will often depend on the knowledge the company has regarding any particular difficulties those using the website might encounter, as well as available resources and improvements with technology.&nbsp;&nbsp;&nbsp;<\/p>\n\n\n\n<p>Despite the efforts we may have made regarding accessibility, consistent with normal business practices for a company of or size and resources, some content, features, processes, or policies, may be improved, so we welcome your suggestions.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Third Party Applications<\/strong><\/h4>\n\n\n\n<p>Our website may use third-party add-ons or “plugins” for certain functions, such as Google Maps, social media feeds, etc.&nbsp;These may not work or may not work the same for every user and\/or every type of disability.&nbsp; We do not have control over the structure of these plugins, and are unable to modify them at all or to the extent that would accommodate every user of our website, and are not responsible for those elements which we do not control.&nbsp;&nbsp;&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>We Are Here for You<\/strong><\/h2>\n\n\n\n<p>If you are experiencing difficulties with any content on our website because of a disability, or if you require assistance with any part of our site because of your particular disability, please contact us and let us know.&nbsp; We will be happy to assist.&nbsp;&nbsp;<\/p>\n\n\n\n<p>If you have a disability that has caused or may likely cause you difficulty in accessing or navigating any part of our website because of your particular disability, you can send us an email to:&nbsp;<a href=\"mailto:theteam@avocadu.com\">theteam@avocadu.com<\/a>.&nbsp;Please provide as much detail as possible, what type of difficulty you had, or may have had, or believe others may have. &nbsp;Note: if the email is sent to a third-party website or mail server for forwarding to us, the third-party website or mail servers does not itself read or respond to these emails, but will only forward such email to us without prior review.<\/p>\n\n\n\n<p>In contacting us by email, your privacy will be strictly protected.&nbsp;This means that&nbsp;you will not be required to provide any personal information, including but not limited to your:<\/p>\n\n\n\n<p>Name, address, telephone number, the specific type of disability you may have, information about goods, products, or services you might be interested in, email address (unless you include it in an email you send to us or to our representatives).<\/p>\n\n\n\n<p>For Accessibility features of popular browsers and third-party screen readers and other devices&nbsp;to assist with access to websites can be found&nbsp; at&nbsp;<a href=\"https:\/\/www.karlinlaw.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Karlinlaw.com<\/a>&nbsp;and in particular&nbsp;<a href=\"http:\/\/www.karlinlaw.com\/Accessibility-Statements-for-Websites.shtml\" target=\"_blank\" rel=\"noreferrer noopener\">Karlinlaw.com\/Accessibility-Statements-for-Websites.shtml<\/a>&nbsp;<\/p>\n\n\n\n<p>Copyright (c) 2020 by The Karlin Law Firm LLP<\/p>\n","protected":false},"excerpt":{"rendered":"<p>General Access to any company’s website can be challenging for persons having certain disabilities.&nbsp;A person’s disability is often unique. What may work well for one person, may cause difficulties for another person.&nbsp; Our company has made efforts to accommodate as many of our customers and potential customers as is reasonable given our size, resources, and&#8230;<\/p>\n","protected":false},"author":18,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_kad_blocks_custom_css":"","_kad_blocks_head_custom_js":"","_kad_blocks_body_custom_js":"","_kad_blocks_footer_custom_js":"","_kad_post_transparent":"","_kad_post_title":"","_kad_post_layout":"","_kad_post_sidebar_id":"","_kad_post_content_style":"","_kad_post_vertical_padding":"","_kad_post_feature":"","_kad_post_feature_position":"","_kad_post_header":false,"_kad_post_footer":false,"footnotes":""},"taxonomy_info":[],"featured_image_src_large":false,"author_info":{"display_name":"Cathy Dean","author_link":"https:\/\/avocadu.com\/author\/cathydean\/"},"comment_info":0,"_links":{"self":[{"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/pages\/31341"}],"collection":[{"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/users\/18"}],"replies":[{"embeddable":true,"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/comments?post=31341"}],"version-history":[{"count":5,"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/pages\/31341\/revisions"}],"predecessor-version":[{"id":34848,"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/pages\/31341\/revisions\/34848"}],"wp:attachment":[{"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/media?parent=31341"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}