{"id":38,"date":"2015-09-26T17:32:13","date_gmt":"2015-09-26T21:32:13","guid":{"rendered":"https:\/\/avocadu.com\/?page_id=38"},"modified":"2022-06-07T17:39:28","modified_gmt":"2022-06-07T21:39:28","slug":"privacy-policy","status":"publish","type":"page","link":"https:\/\/avocadu.com\/privacy-policy\/","title":{"rendered":"Privacy Policy"},"content":{"rendered":"\n<p>Hey there. Cathy here. I own and operate Avocadu.com and may operate other websites in conjunction with this one. I am committed to respect and protect your privacy through this Privacy Policy.<\/p>\n\n\n\n<p>This policy governs your access to and use of Avocadu.com, including any content, functionality, and services offered on this website. Please read the entire policy before you use or interact with this website.&nbsp;By using this website, you accept and agree to the policy outlined on this page.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">USERS UNDER THE AGE OF 18<\/h4>\n\n\n\n<p>This website is not intended for users under the age of 18. If you are under the age of 18, please do not visit or interact with this website in any way or provide any information to us. We do not knowingly collect personal information from users under the age of 18.<\/p>\n\n\n\n<h2 class=\"p4 wp-block-heading\"><span class=\"s1\"><b>1.<\/b><\/span><span class=\"s1\"><b>&nbsp;Users Located in the European Union<\/b><\/span><\/h2>\n\n\n\n<h3 class=\"p4 wp-block-heading\"><strong><span class=\"s1\">Collection of Personal Data<\/span><\/strong><\/h3>\n\n\n\n<p class=\"p4\"><span class=\"s1\">Personal data is information that can be used to identify you such as your name, IP address, and email address. We collect personal data from you in the following ways:<\/span><\/p>\n\n\n\n<ol><li class=\"p4\"><span class=\"s1\">Email Opt-Ins for Free Courses: Your email address.<\/span><\/li><li class=\"p4\">Transaction: Your name, email address, billing information and payment source.<\/li><li class=\"p4\">Submitting Questions Through Comment Boxes: Your name, email address, and question information.<\/li><\/ol>\n\n\n\n<h3 class=\"p4 wp-block-heading\"><span class=\"s1\">Purpose of Processing Your Personal Data<\/span><\/h3>\n\n\n\n<p class=\"p4\"><span class=\"s1\">The information above is collected for the following purposes:<\/span><\/p>\n\n\n\n<ol><li class=\"p4\"><span class=\"s1\">Email Opt-Ins for Free Courses: To provide you with information on the topic in general and information about our paid products.<\/span><\/li><li class=\"p4\">Transaction: To process a purchase you make with us.<\/li><li class=\"p4\">Submitting Questions Through Comment Boxes: To answer any questions you may have for us.<\/li><\/ol>\n\n\n\n<h3 class=\"p4 wp-block-heading\"><strong><span class=\"s1\">Legal Basis for the Collection and&nbsp;Processing of Information<\/span><\/strong><\/h3>\n\n\n\n<p class=\"p4\"><span class=\"s1\">For any communications that you have consented to receive, you can change or remove your consent at any time by contacting Cathy Dean or clicking the“unsubscribe” link located at the bottom of every email to opt out of future emails.<\/span><\/p>\n\n\n\n<p>Legal basis for how we collect information:<\/p>\n\n\n\n<ol><li class=\"p4\"><span class=\"s1\">Email Opt-Ins for Free Courses: You will be asked for consent first.<\/span><\/li><li class=\"p4\">Transaction: Your information is collected as part of a legal contractual transaction.<\/li><li class=\"p4\">Submitting Questions Through Comment Boxes: We need your data to provide you with the information that you requested from us and your information will not be used for other purposes.<\/li><\/ol>\n\n\n\n<p>If you disagree or have any further questions regarding this legal basis, please contact Cathy Dean at theteam@avocadu.com and we will stop processing your data on this legal basis.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Who Has Access to the Data that is Collected?<\/strong><\/h3>\n\n\n\n<p class=\"p4\">We have access to the data that we collect as well as third parties that help us process your personal data, including:<\/p>\n\n\n\n<ul><li>Payment processors (to process your transactions and securely store your data)<\/li><li>Email marketing and communication companies (to collect and send emails)<\/li><li>Survey companies (to receive feedback from customers on courses)<\/li><li>Product hosting platforms (to help you access the products that you purchase)<\/li><li>Other website design, management, and programming services<\/li><\/ul>\n\n\n\n<p class=\"p4\"><span class=\"s1\">The third parties above are prohibited from using, sharing or collecting your personal data for any purpose other than the reasons stated above.<\/span><\/p>\n\n\n\n<h3 class=\"p4 wp-block-heading\"><span class=\"s1\">Use of Cookies and Social Media Pixels<\/span><\/h3>\n\n\n\n<p class=\"p4\"><span class=\"s1\">We use cookies and other technologies in some cases, like social media pixels, to track the particular behavior of visitors to this website. We use this tracking to help us understand how visitors use our site, what interests them, how they respond to marketing, and other reasons such as whether or not a visitor is using a desktop or mobile computer. These cookies can be blocked by changing your internet browser settings.&nbsp;<\/span><\/p>\n\n\n\n<p><span class=\"s1\">In the case of pixels, we may use them to tailor advertising messages users see when visiting social media websites. We reserve the right to use these pixels in compliance with the policies of the various social media sites.<\/span><\/p>\n\n\n\n<h3 class=\"p4 wp-block-heading\"><span class=\"s1\">Changing, Removing, or Requesting Your Data<\/span><\/h3>\n\n\n\n<p>We will retain any information you provide to us until you request us to delete your information, we decide to cease using our existing data providers, or we decide that your data is no longer needed.<\/p>\n\n\n\n<p class=\"p4\"><span class=\"s1\">Under the General Data Protection Regulation, you are granted the following rights:<\/span><\/p>\n\n\n\n<ul class=\"ul1\"><li>You have the right to be informed and this policy serves to inform you.<\/li><li>You have the right to request access to your data that we store and the rights to rectify or erase that data.<\/li><li>You have the right to request restrictions on the processing of your data and the right to object to the processing of your data.<\/li><li>You have the right to the portability of your data.<\/li><li class=\"li4\"><span class=\"s1\">You also have rights in relation to automated decision making and profiling. While this website does not profile you, this is other websites might and this is your right.<\/span><\/li><\/ul>\n\n\n\n<p>For any of the above requests, please contact Cathy Dean at theteam@avocadu.com with your request.<\/p>\n\n\n\n<h3 class=\"p4 wp-block-heading\"><strong><span class=\"s1\">Data Transfer to Third Countries<\/span><\/strong><\/h3>\n\n\n\n<p class=\"p4\"><span class=\"s1\">Your data is never transferred to third countries. This website is located in the United States and your data is collected and held here.<\/span><\/p>\n\n\n\n<p class=\"p4\"><span class=\"s1\">Questions, Concerns, and Contact<\/span><\/p>\n\n\n\n<p class=\"p4\"><span class=\"s1\">If you have any comments, questions, or concerns, please contact Cathy Dean at theteam@avocadu.com. <\/span><\/p>\n\n\n\n<p class=\"p4\"><span class=\"s1\">If you feel that a privacy issue has not be resolved after you have contacted us, you have the right to lodge a complaint with a supervisory authority that has jurisdiction over issues related to the General Data Protection Regulation.<\/span><\/p>\n\n\n\n<h4 class=\"p4 wp-block-heading\"><strong><span class=\"s1\">Data Controller<\/span><\/strong><\/h4>\n\n\n\n<p class=\"p4\"><span class=\"s1\">Representative: Michael Dean<\/span><\/p>\n\n\n\n<p class=\"p4\"><span class=\"s1\">Avocadu.com<\/span><\/p>\n\n\n\n<p class=\"p4\"><span class=\"s1\">PO BOX 9681<\/span><\/p>\n\n\n\n<p class=\"p4\"><span class=\"s1\">Knoxville,<\/span> TN 37940<\/p>\n\n\n\n<p class=\"p4\"><span class=\"s1\">You can also send any communications to Michael Dean, PO BOX 9681, Knoxville, TN 37940<\/span><\/p>\n\n\n\n<h2 class=\"p4 wp-block-heading\"><span class=\"s1\"><b> Users located in the Outside of the EU<\/b><\/span><\/h2>\n\n\n\n<h3 class=\"wp-block-heading\">Website Visitors<\/h3>\n\n\n\n<p>Like most website operators, we collect non-personally-identifying information of the sort that web browsers and servers typically make available, such as the browser type, language preference, referring site, and the date and time of each visitor request. Our purpose in collecting this information is to better understand how visitors use and interact with our website.<\/p>\n\n\n\n<p>We also collect information like Internet Protocol (IP) addresses for logged in users and for users leaving comments on our blog and related websites. We only disclose&nbsp;logged in user and commenter IP addresses under the same circumstances that we use and disclose personally-identifying information as described below, except that commenter IP addresses and email addresses are visible and disclosed to the administrators of the blog or site where the comment was left.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Collection of Personal Information<\/h3>\n\n\n\n<p>Depending on how users are interacting with this website, some personal information must be collected. The amount and type of information that is collected depends on the nature of the interaction. For example, we ask visitors who ask us a question through our comment form to provide their name and email address. This is so that we can respond to them and provide them with the information&nbsp;that was requested.<\/p>\n\n\n\n<p>Purchase transactions require additional information, including other personal and financial information required to process the transactions. In each case, we only collect the necessary information required to complete the interaction. We do not disclose personal information other than as outlined below. Visitors may also refuse to supply their personal information at any time, although it may prevent them from engaging in certain website-related activities.<\/p>\n\n\n\n<p>We may collect aggregated statistics about the behavior of visitors to its websites, and we may display this information publicly or provide it to others. However, we do not disclose personal information other than as outlined below.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong> Protection of Personal Information<\/strong><\/h3>\n\n\n\n<p>We disclose personal information only to our contractors and affiliated organizations that need to know that information in order to process it on our behalf or to provide services available at our websites, and that have agreed not to disclose it to others. Some of those contractors and affiliated organizations may be located outside of your home country; by using this website, you consent to the transfer of such information to them. We will not rent or sell personal information to anyone.<\/p>\n\n\n\n<p>Other than to our contractors and affiliated organizations, as described above,we disclose personal information only in response to a subpoena, court order or other governmental request, or when we believe in good faith that disclosure is reasonably necessary to protect the property or rights of our company, third parties or the public at large.<\/p>\n\n\n\n<p>If you are a registered user of this website and have supplied your email address, we may occasionally send you an email to tell you about new features, solicit your feedback, or just keep you up to date with what’s going on with our company.<\/p>\n\n\n\n<p>If you send us communications via email, through our website, or via social media platforms, we reserve the right to publish it in order to help us clarify or respond to your request or to help us support other users. We take all measures reasonably necessary to protect against the unauthorized access, use, alteration or destruction of your personal information.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Use of Cookies and Social Media Pixels<\/h3>\n\n\n\n<p><span class=\"s1\">We use cookies and other technologies in some cases, like Facebook pixels, to track the particular behavior of visitors to this website. We use this tracking to help us understand how visitors use our site, what interests what, how they respond to marketing, and other reasons such as whether or not a visitor is using a desktop or mobile computer. These cookies can be blocked by changing your internet browser settings.&nbsp;<\/span><\/p>\n\n\n\n<p><span class=\"s1\">In the case of pixels, we may use them to tailor advertising messages users see when visiting social media websites. We reserve the right to use these pixels in compliance with the policies of the various social media sites.<\/span><\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Business Transfers<\/h3>\n\n\n\n<p>If we choose to sell this website and all of its assets or they are acquired by another in the unlikely event that we go out of business or enter bankruptcy, user information is considered one of the assets that will be transferred or acquired by a third party. By using this website, you acknowledge that such transfers may occur and that any acquirer of this website may continue to use your personal information as set forth in this policy.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Ads<\/h3>\n\n\n\n<p>Ads appearing on any of our websites may be delivered to users by advertising partners, who may set cookies. These cookies allow the ad server to recognize your computer each time they send you an online advertisement to compile information about you or others who use your computer. This information allows ad networks to, among other things, deliver targeted advertisements that they believe will be of most interest to you. This Privacy Policy covers the use of cookies on our website and does not cover the use of cookies by any advertisers.<\/p>\n\n\n\n<h3>Mediavine Programmatic Advertising (Ver 1.1)<\/h3>\n<p>The Website works with Mediavine to manage third-party interest-based advertising appearing on the Website. Mediavine serves content and advertisements when you visit the Website, which may use first and third-party cookies. A cookie is a small text file which is sent to your computer or mobile device (referred to in this policy as a “device”) by the web server so that a website can remember some information about your browsing activity on the Website.<\/p>\n<p>First party cookies are created by the website that you are visiting. A third-party cookie is frequently used in behavioral advertising and analytics and is created by a domain other than the website you are visiting. Third-party cookies, tags, pixels, beacons and other similar technologies (collectively, “Tags”) may be placed on the Website to monitor interaction with advertising content and to target and optimize advertising. Each internet browser has functionality so that you can block both first and third-party cookies and clear your browser’s cache. The &#8220;help&#8221; feature of the menu bar on most browsers will tell you how to stop accepting new cookies, how to receive notification of new cookies, how to disable existing cookies and how to clear your browser’s cache. For more information about cookies and how to disable them, you can consult the information at <a href=\"https:\/\/www.allaboutcookies.org\/manage-cookies\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">All About Cookies<\/a>.<\/p>\n<p>Without cookies you may not be able to take full advantage of the Website content and features. Please note that rejecting cookies does not mean that you will no longer see ads when you visit our Site. In the event you opt-out, you will still see non-personalized advertisements on the Website.<\/p>\n<p>The Website collects the following data using a cookie when serving personalized ads:<\/p>\n<ul><li>IP Address<\/li><li>Operating System type<\/li><li>Operating System version<\/li><li>Device Type<\/li><li>Language of the website<\/li><li>Web browser type<\/li><li>Email (in hashed form)<\/li><\/ul>\n<p>Mediavine Partners (companies listed below with whom Mediavine shares data) may also use this data to link to other end user information the partner has independently collected to deliver targeted advertisements. Mediavine Partners may also separately collect data about end users from other sources, such as advertising IDs or pixels, and link that data to data collected from Mediavine publishers in order to provide interest-based advertising across your online experience, including devices, browsers and apps. This data includes usage data, cookie information, device information, information about interactions between users and advertisements and websites, geolocation data, traffic data, and information about a visitor’s referral source to a particular website. Mediavine Partners may also create unique IDs to create audience segments, which are used to provide targeted advertising.<\/p>\n<p>If you would like more information about this practice and to know your choices to opt-in or opt-out of this data collection, please visit <a href=\"https:\/\/thenai.org\/opt-out\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">National Advertising Initiative opt out page<\/a>. You may also visit <a href=\"http:\/\/optout.aboutads.info\/#\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Digital Advertising Alliance website<\/a> and <a href=\"http:\/\/optout.networkadvertising.org\/#\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Network Advertising Initiative website<\/a> to learn more information about interest-based advertising. You may download the AppChoices app at <a href=\"https:\/\/youradchoices.com\/appchoices\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Digital Advertising Alliance’s AppChoices app<\/a> to opt out in connection with mobile apps, or use the platform controls on your mobile device to opt out.<\/p>\n<p>For specific information about Mediavine Partners, the data each collects and their data collection and privacy policies, please visit <a href=\"https:\/\/www.mediavine.com\/ad-partners\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Mediavine Partners<\/a>.<\/p>\n\n\n\n\n<h3 class=\"wp-block-heading\">Privacy Policy Changes<\/h3>\n\n\n\n<p>We reserve the right to change this privacy policy at any time at our sole discretion. We encourage you to check this page regularly for updates or changes. Your continued use of this website after changes made to this policy will constitute your acceptance of said changes.<\/p>\n\n\n\n<p>For any other questions, comments, or concerns, please contact Cathy Dean at theteam@avocadu.com.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Hey there. Cathy here. I own and operate Avocadu.com and may operate other websites in conjunction with this one. I am committed to respect and protect your privacy through this Privacy Policy. This policy governs your access to and use of Avocadu.com, including any content, functionality, and services offered on this website. Please read the&#8230;<\/p>\n","protected":false},"author":18,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_kad_blocks_custom_css":"","_kad_blocks_head_custom_js":"","_kad_blocks_body_custom_js":"","_kad_blocks_footer_custom_js":"","_kad_post_transparent":"","_kad_post_title":"","_kad_post_layout":"","_kad_post_sidebar_id":"","_kad_post_content_style":"","_kad_post_vertical_padding":"","_kad_post_feature":"","_kad_post_feature_position":"","_kad_post_header":false,"_kad_post_footer":false,"footnotes":""},"taxonomy_info":[],"featured_image_src_large":false,"author_info":{"display_name":"Cathy Dean","author_link":"https:\/\/avocadu.com\/author\/cathydean\/"},"comment_info":0,"_links":{"self":[{"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/pages\/38"}],"collection":[{"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/users\/18"}],"replies":[{"embeddable":true,"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/comments?post=38"}],"version-history":[{"count":8,"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/pages\/38\/revisions"}],"predecessor-version":[{"id":35703,"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/pages\/38\/revisions\/35703"}],"wp:attachment":[{"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/media?parent=38"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}