{"id":27038,"date":"2017-08-28T06:00:05","date_gmt":"2017-08-28T06:00:05","guid":{"rendered":"https:\/\/avocadu.com\/?p=27038"},"modified":"2021-03-01T09:22:45","modified_gmt":"2021-03-01T14:22:45","slug":"insulin-resistance-and-weight-loss","status":"publish","type":"post","link":"https:\/\/avocadu.com\/insulin-resistance-and-weight-loss\/","title":{"rendered":"Insulin Resistance and Weight Loss"},"content":{"rendered":"\n<p>Do you ever feel like you&#8217;re eating all of the right foods and the scale still doesn&#8217;t move?<\/p>\n\n\n\n<p>Or doesn&#8217;t move as fast as you believe it should for how much energy you&#8217;re putting into your diet?<\/p>\n\n\n\n<p>There could be a very simple reason for this.<\/p>\n\n\n\n<p><strong>It&#8217;s the reason that a lot of the people on our weight loss plan actually DO start dropping the weight fast.<\/strong><\/p>\n\n\n\n<p>Because they&#8217;re tackling the problem from the right angle.<\/p>\n\n\n\n<p>And that angle is something called&nbsp;<em>insulin resistance.<\/em><\/p>\n\n\n\n<p>This pesky little problem is one that affects more than 1 in 3 Americans &#8212; so chew on that for a moment if you&#8217;re thinking this surely doesn&#8217;t apply to you.<\/p>\n\n\n\n<p>Don&#8217;t worry. Most people have no idea that they are &#8220;suffering&#8221; from this.<\/p>\n\n\n\n<p>They only know that weight loss is really freaking hard.<\/p>\n\n\n\n<p>It certainly isn&#8217;t something you were taught in your high school health class, but it is a very serious health condition that is the first step towards diabetes and cardiovascular disease, among other things.<\/p>\n\n\n\n<p><strong>Insulin resistance is related to diabetes, a condition that keeps your body from producing or using its insulin effectively, and it can make it incredibly difficult to lose weight.<\/strong><\/p>\n\n\n\n<p>A heads up before reading this article: The terms &#8216;<em>diabetes<\/em>&#8216; and &#8216;<em>prediabetes<\/em>&#8216; are discussed a lot in this article. Even if you don&#8217;t have either of these conditions, don&#8217;t dismiss the information in this article. Here&#8217;s why.<\/p>\n\n\n\n<p><strong>Insulin resistance, left unchecked, can LEAD to diabetes.<\/strong><\/p>\n\n\n\n<p>It&#8217;s the first step in those that become prediabetic and eventually diabetic, and it&#8217;s VERY important to reverse insulin resistance so that you don&#8217;t become diabetic.<\/p>\n\n\n\n<p>In fact, the CDC estimates that about <strong><a href=\"https:\/\/www.cdc.gov\/diabetes\/library\/features\/truth-about-prediabetes.html?CDC_AA_refVal=https%3A%2F%2Fwww.cdc.gov%2Ffeatures%2Fdiabetesprevention%2Findex.html\" target=\"_blank\" rel=\"noopener noreferrer\">1 in 3 Americans<\/a> are prediabetic,<\/strong> which indicates <em>even more<\/em> people than that are insulin resistant.<\/p>\n\n\n\n<p>If you’ve already received a <a href=\"https:\/\/avocadu.com\/10-things-have-type-ii-diabetes\/\" rel=\"noopener noreferrer\">diagnosis of type 2 diabetes<\/a> or you’ve struggled throughout your life with type 1, you may have a deeper understanding of the constant struggle to maintain proper insulin levels.<\/p>\n\n\n\n<p>Here is the problem:<\/p>\n\n\n\n<p><strong>Insulin resistance can cause weight gain and make it VERY difficult to lose weight. <\/strong><strong>The way your body breaks down sugar dictates whether you gain, maintain, or lose pounds.<\/strong><\/p>\n\n\n\n<p>To get a better understanding of this all-too-common condition, let&#8217;s discuss what insulin resistance is, how this condition arises, and what you can to do successfully lose weight while managing your insulin resistance.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What Causes Insulin Resistance?<\/strong><\/h2>\n\n\n\n<p>Let&#8217;s get a bird&#8217;s-eye view of this issue, before we dive into the details.<\/p>\n\n\n\n<p>Insulin resistance is sadly a self-inflicted wound <em>(unless you have type 1 diabetes),<\/em> and unfortunately, most people have no idea that they are severely damaging their bodies.<\/p>\n\n\n\n<p><strong>An overload of sugar and processed carbs in the body, over time, is a leading cause of insulin resistance in today&#8217;s society.<\/strong><\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img loading=\"lazy\" decoding=\"async\" width=\"660\" height=\"425\" src=\"https:\/\/avocadu.com\/wp-content\/uploads\/2017\/08\/processed-carbs-lead-to-insulin-resistance-and-weight-gain-min-resized.jpg\" alt=\"Processed Carbs Lead to Insulin Resistance, Junk Food\" class=\"wp-image-30856\" title=\"processed carbs lead to insulin resistance and weight gain\" srcset=\"https:\/\/avocadu.com\/wp-content\/uploads\/2017\/08\/processed-carbs-lead-to-insulin-resistance-and-weight-gain-min-resized.jpg 660w, https:\/\/avocadu.com\/wp-content\/uploads\/2017\/08\/processed-carbs-lead-to-insulin-resistance-and-weight-gain-min-resized-300x193.jpg 300w, https:\/\/avocadu.com\/wp-content\/uploads\/2017\/08\/processed-carbs-lead-to-insulin-resistance-and-weight-gain-min-resized-365x235.jpg 365w, https:\/\/avocadu.com\/wp-content\/uploads\/2017\/08\/processed-carbs-lead-to-insulin-resistance-and-weight-gain-min-resized-355x229.jpg 355w\" sizes=\"(max-width: 660px) 100vw, 660px\" \/><\/figure><\/div>\n\n\n\n<p>That&#8217;s right&#8211;eating too much junk can make your body stop processing nutrients properly.<\/p>\n\n\n\n<p>What happens is that our bodies can no longer process these carbs and sugars (or ANY healthy food, for that matter), so we lose the inability to burn fat efficiently, and weight gain begins to escalate.<\/p>\n\n\n\n<p>To make matters worse, this continued weight gain further worsens insulin resistance and can lead to diabetes.<\/p>\n\n\n\n<p><em><strong>In short, you &#8216;break&#8217; the body&#8217;s ability to process nutrients effectively. <\/strong><\/em><\/p>\n\n\n\n<p>It&#8217;s a lot like a power surge to your computer&#8211;too much energy (glucose) fries your system!<\/p>\n\n\n\n<p>Even if you feel like you don&#8217;t eat a lot of carbs or sugar, you could be getting them from sneaky sources like high-sugar fruit (bananas, grapes, etc.) and starchy or sugary veggies (like potatoes, peas or corn).<\/p>\n\n\n\n<p>Also, simply being sedentary can increase your risk of insulin resistance, because your body doesn&#8217;t want to absorb energy (glucose) that it can&#8217;t use right away.<\/p>\n\n\n\n<p>Having a lot of visceral fat (internal fat around organs) rather than or in addition to subcutaneous fat (which is right under the skin) can also lead to insulin resistance.<\/p>\n\n\n\n<p>This will look like a body type that has a lot of abdominal fat, and even people who are &#8220;skinny-fat&#8221; without actually being overweight.<\/p>\n\n\n\n<p>Experts believe that <strong>excess visceral fat leads to lipid accumulation in the liver<\/strong>, which then causes &#8220;impaired insulin signaling&#8221; and\/or inflammation of the cytokines, &#8220;which impair insulin action.&#8221; (<a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC4038351\/#:~:text=The%20mechanisms%20by%20which%20visceral,draining%20into%20the%20portal%20vein.\" target=\"_blank\" rel=\"noopener noreferrer\">1<\/a>)<\/p>\n\n\n\n<p>This leads to a vicious cycle of fat that causes insulin resistance, and insulin resistance that causes increased weight gain.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What Exactly is Insulin Resistance?<\/strong><\/h2>\n\n\n\n<p>As&nbsp;<a href=\"https:\/\/www.healthline.com\/health\/diabetes\/insulin-resistance-symptoms#BloodWork3\" target=\"_blank\" rel=\"noopener noreferrer\">Healthline<\/a> defines, <strong>insulin resistance is a condition that results from the body’s ineffective use of insulin and generally leads to diabetes if left untreated.<\/strong><\/p>\n\n\n\n<p>When you eat something sugary or high carb (which easily converts to sugar), your body dumps the glucose into your bloodstream.<\/p>\n\n\n\n<p>This sends a signal to your pancreas to produce insulin, which binds to the glucose and carries it into your cells to be used as energy.<\/p>\n\n\n\n<p>However, if you&#8217;ve already loaded your cells up with glucose and insulin, they become resistant to absorbing more&#8211;which means the glucose stays in your bloodstream, and your pancreas has to make more and more insulin until your body gets the sugar out of your bloodstream.<\/p>\n\n\n\n<p>If your pancreas can&#8217;t make enough insulin to keep up with the glucose, then you have reached type 2 diabetes&#8211;which means without intervention, sugar will continue to build up in your bloodstream, causing very serious health problems.<\/p>\n\n\n\n<p>In addition to all the issues that unregulated blood sugar cause, sugar that builds up in your blood coats your hemoglobin (blood protein). <\/p>\n\n\n\n<p>This makes it sticky, raising your risk of cardiovascular disease, blood clots, and blood vessel damage.<\/p>\n\n\n\n<p>Even people who appear to be a healthy weight can experience insulin resistance, so weight alone is not the deciding factor in evaluation.<\/p>\n\n\n\n<p>But how can you tell if your health is being impacted by insulin resistance?<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Insulin Resistance Symptoms + How to Know If You Have It<\/strong><\/h2>\n\n\n\n<p>The only way to be certain that you are experiencing insulin resistance symptoms is to visit your doctor.<\/p>\n\n\n\n<p>Your doctor can order an A1C test, which measures the average amount of blood sugar you&#8217;ve had in your bloodstream over the last three months.<\/p>\n\n\n\n<p>The Mayo Clinic states that this test delivers a result that tells your doctor how your blood sugar history looks. A normal A1C is any number under 5.7, while anything over 5.7 indicates a potential for diabetes (<a href=\"https:\/\/www.mayoclinic.org\/tests-procedures\/a1c-test\/details\/results\/rsc-20167939\" target=\"_blank\" rel=\"noopener noreferrer\">2<\/a>).<\/p>\n\n\n\n<p>Numbers above 6.5 on multiple tests indicate diabetes, and your doctor will prescribe a course of action that may include medication or insulin injections.<\/p>\n\n\n\n<p>However, common symptoms of insulin resistance may hint at a problem <strong>before you see a specialist.<\/strong><\/p>\n\n\n\n<p>Many individuals suffer from insulin resistance for years before noticing symptoms, since the early signs are fairly subtle. Symptoms can include:<\/p>\n\n\n\n<ul><li><em>Weight gain&nbsp;<\/em><\/li><li><em>Chronic fatigue<\/em><\/li><li><em>Brain fog<\/em><\/li><li><em>High blood pressure<\/em><\/li><li><em>High cholesterol<\/em><\/li><li><em>Extreme hunger or thirst<\/em><\/li><li><em>Frequent urination<\/em><\/li><li><em>Tingling in the hands and feet<\/em><\/li><li><em>And more<\/em><\/li><\/ul>\n\n\n\n<p><strong>If you ignore these symptoms, full-blown diabetes may develop, which causes even worse issues.<\/strong><\/p>\n\n\n\n<p>Severe complications of untreated diabetes include blindness, kidney failure, heart disease, stroke, and loss of toes, feet, or legs.<\/p>\n\n\n\n<p>The best way to ensure your health and well-being is to see your doctor or a specialist to find out if your symptoms are related to diabetes or insulin resistance, or another condition entirely.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>How Common is Insulin Resistance?<\/strong><\/h2>\n\n\n\n<p>Heart.org reports that <strong>insulin resistance affects more than 60 million Americans.<\/strong> While it can lead to the development of diabetes, it is possible to live with insulin resistance without a formal diagnosis (<a href=\"http:\/\/www.heart.org\/HEARTORG\/Conditions\/More\/Diabetes\/AboutDiabetes\/About-Diabetes_UCM_002032_Article.jsp#.WXHBnIgrJhE\" target=\"_blank\" rel=\"noopener noreferrer\">3<\/a>).<\/p>\n\n\n\n<p>Healthline recommends that all people over age 40 undergo testing for diabetes, along with cholesterol and other general tests. Screening for diabetes early can prevent more serious health issues.<\/p>\n\n\n\n<p>However, there are times when people should get tested outside of the normal window. This includes people who are <span style=\"text-decoration: underline;\">mostly sedentary, have family members with diabetes or have high blood pressure.<\/span><\/p>\n\n\n\n<p><a href=\"https:\/\/agamatrix.com\/blog\/insulin-resistance\/\" target=\"_blank\" rel=\"noopener noreferrer\">Certain ethnic groups<\/a> are at a higher risk for developing diabetes, as are women who have previously had gestational diabetes or who have had babies who weighed over nine pounds at birth.<\/p>\n\n\n\n<p>Based on CDC data,<strong> 29.1 million people in the US have diabetes.<\/strong> That&#8217;s roughly 9.3 percent of all Americans!<\/p>\n\n\n\n<p>Further, over 8.1 million are estimated to have diabetes <em>but go undiagnosed<\/em>.<\/p>\n\n\n\n<p>The CDC numbers also project that 15 to 30 percent of people who are <a href=\"https:\/\/avocadu.com\/prevent-pre-diabetes-becoming-diabetes\/\" rel=\"noopener noreferrer\">currently prediabetic<\/a> will end up with type 2 diabetes within five years of their initial diagnosis.<\/p>\n\n\n\n<p>Finally, the CDC reports that <strong>nine out of ten individuals with insulin resistance or pre-diabetes do not know that they have either condition. <\/strong><\/p>\n\n\n\n<p>This is no laughing matter, folks&#8211;insulin resistance is a major health crisis!<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Is Insulin Resistance a Life Sentence?<\/strong><\/h2>\n\n\n\n<p>Fortunately, insulin resistance&nbsp;<em>is<\/em> reversible!<\/p>\n\n\n\n<p>In fact, you can reverse type 2 diabetes, as well&#8211;although you&#8217;ll need to make major, lasting lifestyle changes to stay healthy.<\/p>\n\n\n\n<p><strong>The number one thing that you can do to reverse insulin resistance is to CHANGE YOUR DIET.<\/strong><\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img loading=\"lazy\" decoding=\"async\" width=\"660\" height=\"425\" src=\"https:\/\/avocadu.com\/wp-content\/uploads\/2017\/08\/protein-and-veggie-detox-for-21-day-diet-challenge-200-lbs-resized.jpg\" alt=\"Protein and Veggie Detox for 21 Day Challenge\" class=\"wp-image-30858\" title=\"protein and veggie detox diet for insulin resistance treatment\" srcset=\"https:\/\/avocadu.com\/wp-content\/uploads\/2017\/08\/protein-and-veggie-detox-for-21-day-diet-challenge-200-lbs-resized.jpg 660w, https:\/\/avocadu.com\/wp-content\/uploads\/2017\/08\/protein-and-veggie-detox-for-21-day-diet-challenge-200-lbs-resized-300x193.jpg 300w, https:\/\/avocadu.com\/wp-content\/uploads\/2017\/08\/protein-and-veggie-detox-for-21-day-diet-challenge-200-lbs-resized-365x235.jpg 365w, https:\/\/avocadu.com\/wp-content\/uploads\/2017\/08\/protein-and-veggie-detox-for-21-day-diet-challenge-200-lbs-resized-355x229.jpg 355w\" sizes=\"(max-width: 660px) 100vw, 660px\" \/><\/figure><\/div>\n\n\n\n<p>Like we mentioned earlier, diet is the biggest factor in developing insulin resistance&#8211;so naturally, changing your diet is the best way to fix the issue!<\/p>\n\n\n\n<p>Here are our best diet tips for reversing (or avoiding) insulin resistance:<\/p>\n\n\n\n<ul><li>Take a break from carbs (even the healthy ones!) for at least two weeks<\/li><li>Eat lots of leafy green veggies<\/li><li>Kick sugar or carb cravings by eating plenty of lean protein and healthy fats<\/li><li>Avoid all processed foods, even the ones that seem healthy<\/li><li>Hydrate, hydrate, hydrate by drinking lots of water&#8211;aim for at least 65oz. each day<\/li><li>Give your body a chance to recover by trying intermittent fasting<\/li><\/ul>\n\n\n\n<p>It&#8217;s also a good idea to get up and exercise. Thirty minutes of moderate-intensity exercise (like a brisk walk) at least five times a week is all you need to improve your cardiovascular health.<\/p>\n\n\n\n<p>A PubMed study found that physical activity led to increased insulin sensitivity following exercise. When individuals with insulin resistance exercised, their bodies used insulin more easily (<a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pubmed\/10683091\" target=\"_blank\" rel=\"noopener noreferrer\">4<\/a>).<\/p>\n\n\n\n<p>The effects of exercise lasted for about sixteen hours after the study’s participants stopped their physical activity, which means their blood sugar levels may benefit longer than previously thought.<\/p>\n\n\n\n<p>Plus, losing even a small amount of weight can reduce your insulin resistance.<\/p>\n\n\n\n<p>In fact, according to <a href=\"https:\/\/agamatrix.com\/blog\/insulin-resistance-diet\/\" target=\"_blank\" rel=\"noopener noreferrer\">Melissa Dierks, RDN, LDC, CDCES<\/a>, “A weight loss of 7-10% your current body weight can help prevent pre-diabetes from developing into type 2 diabetes. So, if you weigh 250 lbs., even a 17 lb. weight loss can make a difference.”<\/p>\n\n\n\n<p>Additional research shows that for every two pounds you lose, your risk of developing diabetes drops by 16%. (<a href=\"https:\/\/www.lark.com\/blog\/insulin-resistance-diet\/\" target=\"_blank\" rel=\"noopener noreferrer\">5<\/a>)<\/p>\n\n\n\n<p>If you are experiencing some or all of the symptoms we listed earlier, you probably want to have some blood work done by your doctor, including checking your A1C. You and your doctor can then collaborate on the best course of action.<\/p>\n\n\n\n<p>If you are already diabetic, your treatment will likely range from one to all of the following: taking doctor-prescribed medication, monitoring your food and specifically carbohydrate intake, or injecting insulin daily (only in extreme cases).<\/p>\n\n\n\n<p>But please <em>beware of jumping right on medication to fix your problems. <\/em><\/p>\n\n\n\n<p><strong>Medication will help manage your problems and symptoms, but insulin resistance CANNOT be reversed without a <a href=\"https:\/\/21dayfatlosschallenge.com\/home\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">change in your diet<\/a> and avoiding the foods that caused your problems in the first place.<\/strong><\/p>\n\n\n\n<p>Once your blood sugar stabilizes and your body’s systems are functioning optimally, exercise can also help you keep them in check.<\/p>\n\n\n\n<p>Whatever stage of insulin resistance you&#8217;re in, don&#8217;t give up hope! Making simple diet and lifestyle changes can make all the difference in your long-term health and weight.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>A Plan to Reclaim Your Health<\/strong><\/h2>\n\n\n\n<p>If you&#8217;re feeling overwhelmed or exhausted at the idea of creating a plan to dig yourself out of insulin resistance and finally be fit and healthy, you aren&#8217;t alone!<\/p>\n\n\n\n<p>Many of our clients felt exactly the same way before starting our program—hopeless, exhausted, frustrated, and just <em>over<\/em> weight loss programs that don’t work for them.<\/p>\n\n\n\n<p>We created our<strong> <a href=\"https:\/\/21dayfatlosschallenge.com\/home\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">21 Day Fat Loss Challenge<\/a><\/strong> for people exactly like you—people who feel like they’ve <strong>tried everything under the sun, but just can’t shed the weight or keep it off.<\/strong><\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img loading=\"lazy\" decoding=\"async\" width=\"900\" height=\"270\" src=\"https:\/\/avocadu.com\/wp-content\/uploads\/2017\/09\/21-Day-Fat-Loss-Challenge-Program-by-Avocadu-min.png\" alt=\"21-Day Fat Loss Challenge Program by Avocadu\" class=\"wp-image-27338\" srcset=\"https:\/\/avocadu.com\/wp-content\/uploads\/2017\/09\/21-Day-Fat-Loss-Challenge-Program-by-Avocadu-min.png 900w, https:\/\/avocadu.com\/wp-content\/uploads\/2017\/09\/21-Day-Fat-Loss-Challenge-Program-by-Avocadu-min-300x90.png 300w, https:\/\/avocadu.com\/wp-content\/uploads\/2017\/09\/21-Day-Fat-Loss-Challenge-Program-by-Avocadu-min-768x230.png 768w, https:\/\/avocadu.com\/wp-content\/uploads\/2017\/09\/21-Day-Fat-Loss-Challenge-Program-by-Avocadu-min-365x110.png 365w, https:\/\/avocadu.com\/wp-content\/uploads\/2017\/09\/21-Day-Fat-Loss-Challenge-Program-by-Avocadu-min-355x107.png 355w\" sizes=\"(max-width: 900px) 100vw, 900px\" \/><\/figure><\/div>\n\n\n\n<p>Our challenge provides a step-by-step plan to help you lose up to <strong>21 lbs in just 21 days, with far less effort than you may think!<\/strong><\/p>\n\n\n\n<p>Tons of our clients have turned it into a lifestyle diet and have lost as much as <strong>over 100 pounds<\/strong> with the challenge&#8211;including many members who have <strong>reversed their insulin resistance!<\/strong><\/p>\n\n\n\n<p>The best part? Besides just losing weight, the <strong><a href=\"https:\/\/21dayfatlosschallenge.com\/home\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">21 Day Fat Loss Challenge<\/a><\/strong> was designed to <strong>heal your gut, rebalance your hormones, and retrain your tastebuds<\/strong>—<em>so you’ll actually be able to keep the weight off!<\/em><\/p>\n\n\n\n<p>If you&#8217;re ready to make some&nbsp;changes in your life, this is the ONLY place you should start. &nbsp;We&#8217;ll teach you exactly how to make the necessary changes in your diet and lifestyle, and how to keep them “beyond the diet.”<\/p>\n\n\n\n<p><strong><a href=\"https:\/\/21dayfatlosschallenge.com\/home\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Take control of your life and start your 21 Day Fat Loss Challenge TODAY!<\/a><\/strong><\/p>\n\n\n\n<p>Leave a comment below if you enjoyed this article on the insulin resistance and weight loss, or if you have any questions!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Do you ever feel like you&#8217;re eating all of the right foods and the scale still doesn&#8217;t move? Or doesn&#8217;t move as fast as you believe it should for how much energy you&#8217;re putting into your diet? There could be a very simple reason for this. It&#8217;s the reason that a lot of the people&#8230;<\/p>\n","protected":false},"author":18,"featured_media":30851,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_kad_blocks_custom_css":"","_kad_blocks_head_custom_js":"","_kad_blocks_body_custom_js":"","_kad_blocks_footer_custom_js":"","_kad_post_transparent":"","_kad_post_title":"","_kad_post_layout":"","_kad_post_sidebar_id":"","_kad_post_content_style":"","_kad_post_vertical_padding":"","_kad_post_feature":"","_kad_post_feature_position":"","_kad_post_header":false,"_kad_post_footer":false,"footnotes":""},"categories":[25],"tags":[],"taxonomy_info":{"category":[{"value":25,"label":"Weight Loss"}]},"featured_image_src_large":["https:\/\/avocadu.com\/wp-content\/uploads\/2017\/08\/Insulin-Resistance-for-Weight-Loss.png",500,278,false],"author_info":{"display_name":"Cathy Dean","author_link":"https:\/\/avocadu.com\/author\/cathydean\/"},"comment_info":1,"category_info":[{"term_id":25,"name":"Weight Loss","slug":"weight-loss","term_group":0,"term_taxonomy_id":25,"taxonomy":"category","description":"","parent":0,"count":154,"filter":"raw","cat_ID":25,"category_count":154,"category_description":"","cat_name":"Weight Loss","category_nicename":"weight-loss","category_parent":0}],"tag_info":false,"_links":{"self":[{"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/posts\/27038"}],"collection":[{"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/users\/18"}],"replies":[{"embeddable":true,"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/comments?post=27038"}],"version-history":[{"count":5,"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/posts\/27038\/revisions"}],"predecessor-version":[{"id":31475,"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/posts\/27038\/revisions\/31475"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/media\/30851"}],"wp:attachment":[{"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/media?parent=27038"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/categories?post=27038"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/tags?post=27038"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}