{"id":28205,"date":"2018-04-23T13:42:36","date_gmt":"2018-04-23T13:42:36","guid":{"rendered":"https:\/\/avocadu.com\/?p=28205"},"modified":"2022-05-31T14:10:58","modified_gmt":"2022-05-31T18:10:58","slug":"red-light-therapy-at-home","status":"publish","type":"post","link":"https:\/\/avocadu.com\/red-light-therapy-at-home\/","title":{"rendered":"How to Use Red Light Therapy at Home + Anti-Aging, Skin-Healing Benefits"},"content":{"rendered":"\n<p>Red light therapy treatments are popping up all over the place lately, and there’s a reason for it. It’s an amazing non-invasive treatment for many health and skin issues that is backed by solid research.<\/p>\n\n\n\n<p>Scientists are finding that red light therapy, or low-level light therapy (LLLT), can <strong>diminish and even reverse the signs of aging without any side-effects!<\/strong><\/p>\n\n\n\n<p>This might sound too good to be true, but it&#8217;s really not. If you want a risk-free way to get youthful skin, then red light therapy is the way to go.<\/p>\n\n\n\n<p>Guys, this isn&#8217;t just some fountain of youth mumbo-jumbo.<\/p>\n\n\n\n<p><strong>We HAVE a <a href=\"http:\/\/lddy.no\/2ojh\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">red light therapy machine<\/a> that we purchased after extensive research on the subject.<\/strong><\/p>\n\n\n\n<p>While we all love beautiful skin, LLLT can have the same healing effects on the rest of our biology. People are loving it for its ability to&#8230;<\/p>\n\n\n\n<ul><li><em>repair soft connective tissue, <\/em><\/li><li><em>decrease inflammation and swelling, <\/em><\/li><li><em>reduce the side effects of radiation and chemotherapy, <\/em><\/li><li><em>and decrease the time it takes for wounds to heal&nbsp;<a href=\"https:\/\/www.nasa.gov\/topics\/nasalife\/features\/heals.html\" target=\"_blank\" rel=\"noopener noreferrer\">(1)<\/a>.<\/em><\/li><\/ul>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What is Red Light Therapy?<\/strong><\/h2>\n\n\n\n<p>Low-light, red lasers emit wavelengths through the skin that cause the body to <strong>generate <a href=\"https:\/\/avocadu.com\/collagen-powder-benefits-healthy-skin\/\" rel=\"noopener noreferrer\">collagen<\/a>, increase blood flow, and help tissue to heal on a cellular level.<\/strong> Its medical applications have been used for over 50 years with <strong>extraordinary results and no side-effects.<\/strong><\/p>\n\n\n\n<p>Many studies have been done that show just how effective red light therapy is on both the body and the skin&nbsp;<a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC3065857\/\" target=\"_blank\" rel=\"noopener noreferrer\">(2)<\/a>. There have been absolutely <strong>no cons to using it that scientists can find,<\/strong> other than that it hurts your eyes if you stare directly at the light box for too long (which we don&#8217;t recommend).<\/p>\n\n\n\n<p>You can wear goggles while using it or just simply keep your eyes closed.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>How Does Red Light Therapy Work?<\/strong><\/h2>\n\n\n\n<p>The specific red light used encourages cells in the body to produce more <a href=\"https:\/\/www.worldofmolecules.com\/life\/atp.htm\" target=\"_blank\" rel=\"noopener noreferrer\">adenosine triphosphate<\/a> (ATP). This amazing little molecule acts like a <strong>rechargeable battery in the cell.<\/strong><\/p>\n\n\n\n<p>As you sit here reading about the wonders of red light therapy, your body is burning through billions of energy molecules. ATP molecules stand at the ready to get to work and give you the energy to do everything from blinking your eyes to breathing.<\/p>\n\n\n\n<p>It also <strong>helps skin cells to repair and rejuvenate by penetrating deep into the skin to stimulate circulation and nourishment.<\/strong><\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Is Red Light Therapy Safe?<\/strong><\/h2>\n\n\n\n<h2 class=\"wp-block-heading\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-28469 size-full\" title=\"red light therapy machine on and off state\" src=\"https:\/\/avocadu.com\/wp-content\/uploads\/2018\/04\/red-light-therapy-machine-on-and-off-state-min.png\" alt=\"red light therapy machine on and off state\" width=\"700\" height=\"500\" srcset=\"https:\/\/avocadu.com\/wp-content\/uploads\/2018\/04\/red-light-therapy-machine-on-and-off-state-min.png 700w, https:\/\/avocadu.com\/wp-content\/uploads\/2018\/04\/red-light-therapy-machine-on-and-off-state-min-300x214.png 300w, https:\/\/avocadu.com\/wp-content\/uploads\/2018\/04\/red-light-therapy-machine-on-and-off-state-min-365x261.png 365w, https:\/\/avocadu.com\/wp-content\/uploads\/2018\/04\/red-light-therapy-machine-on-and-off-state-min-355x254.png 355w\" sizes=\"(max-width: 700px) 100vw, 700px\" \/><\/h2>\n\n\n\n<p>The answer to this question is an emphatic yes! It’s <a href=\"http:\/\/www.besthealthmag.ca\/best-looks\/skin\/is-red-light-therapy-safe\/\" target=\"_blank\" rel=\"noopener noreferrer\">safer<\/a> than anything else out there right now. Here are a few reasons why:<\/p>\n\n\n\n<ul><li><em>It’s drug and chemical-free.<\/em><\/li><li><em>No needles or knives are used (thank goodness!).<\/em><\/li><li><em>It’s painless and can be used on all skin types.<\/em><\/li><li><em>Children and even babies can receive its benefits, as long as eye protection is used.<\/em><\/li><li><em>There are no adverse short-term or long-term side effects.<\/em><\/li><li><em>It’s <strong>FDA-approved.<\/strong><\/em><\/li><\/ul>\n\n\n\n<p>It&#8217;s safe enough now that the technology isn&#8217;t just available at the spa or dermatologist, but is also available for home-use with personal red light therapy machines like the <a href=\"http:\/\/lddy.no\/2ojh\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Joov<\/a>.<\/p>\n\n\n\n<p>The <a href=\"http:\/\/lddy.no\/2ojh\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Joov<\/a> is what we purchased after extensive research, and it comes in a few different sizes depending on what your needs are. If you are mainly looking to improve the look of the skin on your face, the smallest size would be ideal. If you want it for more of the deeper tissue benefits, a larger machine would be ideal for you.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Benefits of Red Light Therapy on the Skin<\/strong><\/h2>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>1. It helps repair sun damage. <\/strong><\/h3>\n\n\n\n<p>As glorious as a tan looks, basking in the sun can cause quite a bit of damage to the skin. The sun&#8217;s light rays <strong>damage the elastin in the skin cells,<\/strong> which leads to age spots and wrinkles later in life.<\/p>\n\n\n\n<p>Red light therapy will <strong>stimulate collagen and bring nourishment to the damaged cells, healing crepey skin and lightening age spots.<\/strong> It’s also shown to <strong>prevent skin cancer<\/strong> that might be caused by too much sun <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC3423866\/\" target=\"_blank\" rel=\"noopener\">(3)<\/a>.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>2. It<\/strong> <strong>rejuvenates skin, smoothes skin tone, and reduces wrinkles. <\/strong><\/h3>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignright\"><img loading=\"lazy\" decoding=\"async\" width=\"300\" height=\"200\" src=\"https:\/\/avocadu.com\/wp-content\/uploads\/2016\/05\/clear-skin-health-benefit-of-fasting.jpg\" alt=\"red light therapy for increased collagen and healthier skin\" class=\"wp-image-6339\" title=\"red light therapy for increased collagen and healthier skin\"\/><\/figure><\/div>\n\n\n<p>One of the reasons we get wrinkles as we age is because our skin loses collagen. Collagen is also responsible for how our skin feels.<\/p>\n\n\n\n<p>A study in the journal Photomedicine and Laser Surgery showed that LLLT “improved skin complexion, improved skin tone, improved texture\/feeling, reduced skin roughness, reduced signs of wrinkles and fine lines, and increased collagen density as measured through ultrasonographic tests.”&nbsp;<a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC3926176\/\" target=\"_blank\" rel=\"noopener noreferrer\">(4)<\/a><\/p>\n\n\n\n<p><em>What’s not to like about that?<\/em><\/p>\n\n\n\n<p>You can take <a href=\"https:\/\/avocadu.com\/collagen-powder-benefits-healthy-skin\/\" rel=\"noopener noreferrer\">collagen supplements<\/a> these days, but they don&#8217;t actually cause your skin to produce more collagen like red light therapy does.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>3. Puffiness and swelling are reduced. <\/strong><\/h3>\n\n\n\n<p>Red light therapy stimulates lymph system activity which will have the effect of <strong>getting rid of swelling, both short-term and long-term.<\/strong><\/p>\n\n\n\n<p>It can help heal swelling from an injury but also <strong>get rid of the bags under your eyes by reducing fluid retention.<\/strong> If you engage in regular rigorous exercise like weight lifting that leaves the muscles sore afterward, red light therapy can help ease this soreness.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>4. Say goodbye to <\/strong><strong>acne<\/strong><strong>, psoriasis, and eczema. <\/strong><\/h3>\n\n\n\n<p>Infrared light is known to be amazing for <a href=\"https:\/\/avocadu.com\/foods-reduce-inflammation\/\" rel=\"noopener noreferrer\">decreasing inflammation,<\/a> so of course it works great on skin conditions that are a result of a wonky immune system.<\/p>\n\n\n\n<p>Paired with the shorter red wavelengths in LLLT, it also heals the skin surface, <strong>decreasing the likelihood of scarring once the condition clears.<\/strong><\/p>\n\n\n\n<p>Red light therapy causes the body to produce more <a href=\"https:\/\/www.vitamindcouncil.org\/health-conditions\/eczema\/\" target=\"_blank\" rel=\"noreferrer noopener\">vitamin D<\/a>, a vitamin that most people are deficient in. If we don’t get enough sunlight, we usually have a shortage, which is known to cause eczema and psoriasis.<\/p>\n\n\n\n<p>The irony of it all is that the more sun we get, skin issues like acne will usually clear up because of the vitamin D we absorb from the sun’s rays, but too much sun can cause skin damage.<\/p>\n\n\n\n<p>When used in conjunction with blue light, it will even kill the bacteria that causes <a href=\"https:\/\/www.acne.org\/light-therapy.html\" target=\"_blank\" rel=\"noopener noreferrer\">acne<\/a>. Red light therapy is a much safer way to get the <strong>skin-healing benefits of the sun without all the negative effects of sun damage.<\/strong><\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>5. Red light therapy treats and prevents cold sores. <\/strong><\/h3>\n\n\n\n<p>Cold sores love to grace us with their presence at the worst possible moments. Many a wedding photo and prom picture have been photoshopped because of an ill-timed breakout.<\/p>\n\n\n\n<p>Cold sores usually pop up when the immune system is overworked; stress and illness are the two biggest culprits. Creams can clear up a sore, but it can take anywhere from one to two weeks. Red light therapy can <strong>cut that healing time in half.<\/strong><\/p>\n\n\n\n<p>It’s also thought to<strong> heal the issue permanently over time,<\/strong> although more study needs to be done to confirm it.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>6. Circulation is increased.&nbsp; <\/strong><\/h3>\n\n\n\n<p>You already know now that it helps the body produce new collagen, but it also <strong>increases circulation.<\/strong> This has a huge impact on skin tone and gives our body’s natural defenses an extra boost.<\/p>\n\n\n\n<p>The increased circulation, along with its anti-inflammatory benefits, does wonders for both the skin and inflammation caused by conditions like arthritis.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>7. It speeds up wound healing for cuts, burns, abrasions, and bruises. <\/strong><\/h3>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter\"><img loading=\"lazy\" decoding=\"async\" width=\"500\" height=\"333\" src=\"https:\/\/avocadu.com\/wp-content\/uploads\/2018\/04\/red-light-therapy-at-home-min.png\" alt=\"red light therapy at home\" class=\"wp-image-28472\" title=\"red light therapy at home\" srcset=\"https:\/\/avocadu.com\/wp-content\/uploads\/2018\/04\/red-light-therapy-at-home-min.png 500w, https:\/\/avocadu.com\/wp-content\/uploads\/2018\/04\/red-light-therapy-at-home-min-300x200.png 300w, https:\/\/avocadu.com\/wp-content\/uploads\/2018\/04\/red-light-therapy-at-home-min-365x243.png 365w, https:\/\/avocadu.com\/wp-content\/uploads\/2018\/04\/red-light-therapy-at-home-min-355x236.png 355w\" sizes=\"(max-width: 500px) 100vw, 500px\" \/><\/figure><\/div>\n\n\n<p>Fun fact; LLLT was originally used by NASA for <a href=\"http:\/\/www.dailymail.co.uk\/femail\/article-2087046\/Go-red-light-From-wrinkles-cold-sores-red-light-therapy-latest-trick-save-face.html\" target=\"_blank\" rel=\"noopener noreferrer\">wound-healing in space.<\/a> Our astronauts can boldly go where no man has gone, injury-free, and look good while doing it.<\/p>\n\n\n\n<p>Bruises are caused by blood leaking into the skin tissue when we get injured or have broken capillaries. If there’s no place for the blood to exit the skin, then it pools and causes a bruise.<\/p>\n\n\n\n<p>Red light therapy <strong>delivers nutrient-rich blood<\/strong> to the area which will help create new capillaries and <strong>repair the damage.<\/strong> It does the same thing for cuts, scrapes, and burns.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>8. Dry, flaky skin is a thing of the past. <\/strong><\/h3>\n\n\n\n<p>The increased nutrients and circulation quench thirsty skin. Good blood supply to the surface of the skin creates a&nbsp;<strong>hydrating effect.<\/strong><\/p>\n\n\n\n<p>The oil and sweat glands are stimulated, which creates a barrier on the skin that will keep it hydrated. Don’t worry, though! The extra oil won’t normally make you break out.<\/p>\n\n\n\n<p>It also <strong>stimulates fibroblast activity,<\/strong> which is going to give you nice, firm skin without the dryness.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>9. It’s an effective hair loss remedy. <\/strong><\/h3>\n\n\n\n<p>Hair loss as we age is a big beauty issue for both women and men, so this is great news! Studies&nbsp;show that infrared light has a <strong>significant impact on hair thinning and can stop it in its tracks<\/strong> <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pubmed\/24474647\" target=\"_blank\" rel=\"noopener noreferrer\">(5).<\/a><\/p>\n\n\n\n<p>Just like with the rest of the body, increased circulation and nutrients stimulate the hair follicles to grow more hair without drugs or surgery. It <strong>improves density and thickness in just a few months.<\/strong><\/p>\n\n\n\n<p>They even sell <strong>red light therapy helmets<\/strong> specifically to improve hair growth and thickness. You can wear it while working, folding laundry, etc.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>10. Scars and stretch marks fade. <\/strong><\/h3>\n\n\n\n<p>We can get scars from injuries, but more often than not, scars on the face are caused by acne or picking at pimples. LLLT not only <strong>fades the discoloration from scarring but improves the texture of skin when collagen fills in acne pits.<\/strong><\/p>\n\n\n\n<p><a href=\"https:\/\/theorganicbeautyexpert.com\/how-to-get-rid-of-stretch-marks\/\" target=\"_blank\" rel=\"noopener noreferrer\">Stretch marks<\/a> are caused when we have a growth spurt or gain weight, and boy are they hard to get rid of! Fortunately, red light therapy can <strong>flatten out the scars and fade them over time.<\/strong><\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>11. Red light therapy reduces cellulite<\/strong>.<\/h3>\n\n\n\n<p>Now you can finally throw away all those cellulite creams and massage wands that don’t work because LLLT is proven to <strong>reduce body circumference measurements<\/strong> <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC3769994\/\" target=\"_blank\" rel=\"noopener noreferrer\">(6)<\/a>.<\/p>\n\n\n\n<p>It also fights cellulite by <strong>improving skin texture and lymphatic drainage,<\/strong> which is a big culprit in the formation of fatty deposits.<\/p>\n\n\n\n<p>Be wary of spas that claim that red light therapy burns calories. It has no known effect on your metabolism. Its ability to shape the body and thin the fat layer in the skin is probably due to the lymphatic drainage, which <strong>reduces swelling<\/strong> in the area.<\/p>\n\n\n\n<p>The <a href=\"https:\/\/draxe.com\/lymphatic-system\/\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>lymphatic system<\/strong><\/a> is an important part of our immune system that helps carry waste out of the body, so we get <a href=\"https:\/\/avocadu.com\/16-foods-that-naturally-detoxify-your-body\/\" rel=\"noopener noreferrer\">detoxification<\/a> as part of our cellulite busting session, which is an added bonus.<\/p>\n\n\n\n<p>Researchers also suggest that getting regular massages along with infrared treatments will produce the best results.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>12. It removes facial redness without damaging skin. <\/strong><\/h3>\n\n\n\n<p>Rosacea is a rough condition to have. Heat, exercise, and stress can all trigger it. On top of the red, inflamed-looking skin that rosacea causes, the bloodshot eyes that go with it are a bummer.<\/p>\n\n\n\n<p>Red light therapy can <strong>reduce the flushing, heal the inflammation that causes pain, repair broken capillaries, and increase the skin’s ability to heal itself.<\/strong> It might take a little longer than other treatments, but the results are safe and pain-free.<\/p>\n\n\n\n<p>People often see improvements in about two weeks, and with regular treatments, the results can be permanent<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>How to Use Red Light Therapy at Home<\/strong><\/h2>\n\n\n\n<p>We did the math on whether it would be more affordable to go to red light therapy sessions (they have them at dermatology offices and even tanning salons) or to just buy a <a href=\"http:\/\/lddy.no\/2ojh\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">red light therapy machine.<\/a><\/p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignright\"><img loading=\"lazy\" decoding=\"async\" width=\"683\" height=\"1024\" src=\"https:\/\/avocadu.com\/wp-content\/uploads\/2018\/03\/Joov-Mini-min-683x1024.png\" alt=\"Joov mini red light therapy machine\" class=\"wp-image-28396\" srcset=\"https:\/\/avocadu.com\/wp-content\/uploads\/2018\/03\/Joov-Mini-min-683x1024.png 683w, https:\/\/avocadu.com\/wp-content\/uploads\/2018\/03\/Joov-Mini-min-200x300.png 200w, https:\/\/avocadu.com\/wp-content\/uploads\/2018\/03\/Joov-Mini-min-768x1151.png 768w, https:\/\/avocadu.com\/wp-content\/uploads\/2018\/03\/Joov-Mini-min-183x274.png 183w, https:\/\/avocadu.com\/wp-content\/uploads\/2018\/03\/Joov-Mini-min-178x266.png 178w, https:\/\/avocadu.com\/wp-content\/uploads\/2018\/03\/Joov-Mini-min.png 1108w\" sizes=\"(max-width: 683px) 100vw, 683px\" \/><\/figure><\/div>\n\n\n<p>Ultimately, buying a machine won out as the more affordable option. We looked into different machines and ended up settling on the <a href=\"http:\/\/lddy.no\/2ojh\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Joov<\/a>. It had great reviews and came recommended from other websites that we trusted.<\/p>\n\n\n\n<p>You&#8217;ve also got a few options with the <a href=\"http:\/\/lddy.no\/2ojh\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Joov<\/a> because you can get it in various sizes.<\/p>\n\n\n\n<p>They have the mini, original, and the max.<\/p>\n\n\n\n<p>The Mini is pictured in this article. We ended up going with the Max and the &#8220;Combo&#8221; wavelengths after doing some extensive research into red light therapy.<\/p>\n\n\n\n<p>If you want to try out the Joov today, you can use the coupon code &#8220;<strong>AVOCADU<\/strong>&#8221; to <a href=\"http:\/\/lddy.no\/2ojh\" target=\"_blank\" rel=\"noreferrer noopener nofollow\"><strong>get $25 off your purchase!<\/strong><\/a><\/p>\n\n\n\n<p>There are also <a href=\"https:\/\/amzn.to\/2F9STxE\" target=\"_blank\" rel=\"nofollow sponsored noreferrer noopener\">smaller versions<\/a> available to purchase on Amazon, but make sure you dig into the reviews from any of these companies to ensure that they are using the right technology and not a weaker form of the light.<\/p>\n\n\n\n<p>I recommend against a <a href=\"https:\/\/amzn.to\/2F9STxE\" target=\"_blank\" rel=\"nofollow sponsored noreferrer noopener\">handheld red light device<\/a> because your entire face can&#8217;t absorb the benefits at once. The benefits that you receive from 5 minutes of a larger device like the <strong><a href=\"http:\/\/lddy.no\/2ojh\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Joov<\/a><\/strong> will take you a half hour or more from a handheld due to the limited surface area it covers.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Related Biohacking Articles<\/h2>\n\n\n\n<ul><li><a href=\"https:\/\/avocadu.com\/chilisleeps-ooler-sleep-system-review-goodbye-night-sweats\/\">ChiliSleep’s OOLER Sleep System Review: Goodbye Night Sweats!<\/a><\/li><li><a href=\"https:\/\/avocadu.com\/sun-home-saunas-infrared-sauna-blanket-review\/\">Sun Home Saunas Infrared Sauna Blanket Review<\/a><\/li><\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Red light therapy treatments are popping up all over the place lately, and there’s a reason for it. It’s an amazing non-invasive treatment for many health and skin issues that is backed by solid research. Scientists are finding that red light therapy, or low-level light therapy (LLLT), can diminish and even reverse the signs of&#8230;<\/p>\n","protected":false},"author":18,"featured_media":31398,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_kad_blocks_custom_css":"","_kad_blocks_head_custom_js":"","_kad_blocks_body_custom_js":"","_kad_blocks_footer_custom_js":"","_kad_post_transparent":"","_kad_post_title":"","_kad_post_layout":"","_kad_post_sidebar_id":"","_kad_post_content_style":"","_kad_post_vertical_padding":"","_kad_post_feature":"","_kad_post_feature_position":"","_kad_post_header":false,"_kad_post_footer":false,"footnotes":""},"categories":[29],"tags":[],"taxonomy_info":{"category":[{"value":29,"label":"Healthy Living"}]},"featured_image_src_large":["https:\/\/avocadu.com\/wp-content\/uploads\/2018\/04\/Red-Light-Therapy-Featured-New.png",500,278,false],"author_info":{"display_name":"Cathy Dean","author_link":"https:\/\/avocadu.com\/author\/cathydean\/"},"comment_info":5,"category_info":[{"term_id":29,"name":"Healthy Living","slug":"healthy-living","term_group":0,"term_taxonomy_id":29,"taxonomy":"category","description":"","parent":0,"count":128,"filter":"raw","cat_ID":29,"category_count":128,"category_description":"","cat_name":"Healthy Living","category_nicename":"healthy-living","category_parent":0}],"tag_info":false,"_links":{"self":[{"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/posts\/28205"}],"collection":[{"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/users\/18"}],"replies":[{"embeddable":true,"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/comments?post=28205"}],"version-history":[{"count":5,"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/posts\/28205\/revisions"}],"predecessor-version":[{"id":35677,"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/posts\/28205\/revisions\/35677"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/media\/31398"}],"wp:attachment":[{"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/media?parent=28205"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/categories?post=28205"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/tags?post=28205"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}