{"id":32350,"date":"2021-08-30T04:55:00","date_gmt":"2021-08-30T08:55:00","guid":{"rendered":"https:\/\/avocadu.com\/?p=32350"},"modified":"2023-03-07T08:34:41","modified_gmt":"2023-03-07T13:34:41","slug":"how-julai-lost-the-baby-weight","status":"publish","type":"post","link":"https:\/\/avocadu.com\/how-julai-lost-the-baby-weight\/","title":{"rendered":"How Julai Finally Lost the Baby Weight and Changed Her Life for the Better"},"content":{"rendered":"\n<p>Weight changes are common as you get older, and are caused by all sorts of things, like hormonal changes, stress, lifestyle changes, and etc.&nbsp;<\/p>\n\n\n\n<p>And you know what major change involves pretty much every major change we just listed?&nbsp;<\/p>\n\n\n\n<p><em>Going through pregnancy, breastfeeding, and parenthood!<\/em><\/p>\n\n\n\n<p>You’re supposed to gain some weight during pregnancy in order to support the health of your and your unborn baby.&nbsp;<\/p>\n\n\n\n<p>But losing that baby weight under the stress of <strong>little to no sleep, total lifestyle upheaval, major hormonal fluctuations<\/strong>,<strong> and everything else that goes into being a new mom<\/strong> can feel impossible.<\/p>\n\n\n\n<p>Our friend Julai over at <a href=\"https:\/\/happyheartyhome.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Happy Hearty Home<\/a> was definitely feeling stressed and overwhelmed trying to lose weight after having two pregnancies close together.&nbsp;<\/p>\n\n\n\n<p>She had gained a total of 10 kg (22 lbs), and despite plenty of exercise, eating lots of what she considered healthy foods, and trying to cut down on the amount of food she ate, <strong>she just couldn’t shed those extra pounds<\/strong>.&nbsp;<\/p>\n\n\n\n<p>Then, she found our <a href=\"https:\/\/21dayfatlosschallenge.com\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">21-Day Fat Loss Challenge<\/a>, and lost weight faster than she ever expected.&nbsp;<\/p>\n\n\n\n<p>Read on to find out how Julai was finally able to lose the baby weight, and why our program made all the difference and finally worked for her.&nbsp;&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Meet Julai<\/strong><\/h2>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"500\" height=\"660\" src=\"https:\/\/avocadu.com\/wp-content\/uploads\/2021\/08\/Julai-in-Garden-with-Family-min.png\" alt=\"Julai and family in the garden - Julai, husband and their two small children\" class=\"wp-image-32362\" srcset=\"https:\/\/avocadu.com\/wp-content\/uploads\/2021\/08\/Julai-in-Garden-with-Family-min.png 500w, https:\/\/avocadu.com\/wp-content\/uploads\/2021\/08\/Julai-in-Garden-with-Family-min-227x300.png 227w, https:\/\/avocadu.com\/wp-content\/uploads\/2021\/08\/Julai-in-Garden-with-Family-min-15x20.png 15w\" sizes=\"(max-width: 500px) 100vw, 500px\" \/><\/figure><\/div>\n\n\n\n<p>For many women, having children is the point where they first start to struggle with their weight.&nbsp;<\/p>\n\n\n\n<p>Not only do most mothers experience major hormonal shifts that make it easier to gain weight and harder to lose it, most of us also experience changes in the shape of our bodies&#8211;widened hips, softer bellies, extra curves and rolls, stretched-out skin, and more.&nbsp;<\/p>\n\n\n\n<p>Julai didn’t struggle with her weight too much before having children, but she wasn’t the picture of health, either.&nbsp;<\/p>\n\n\n\n<p>She had always struggled with portion control, and her husband used to tease her that she often ate more than him.&nbsp;<\/p>\n\n\n\n<p>Even though she and her family ate mostly natural, healthy foods, they often ate a lot of fruit and added sugars&#8211;specifically honey, since Julai’s husband is a beekeeper.&nbsp;<\/p>\n\n\n\n<p>Once she had kids&#8211;and especially while breastfeeding&#8211;her portions grew larger, and snacks became more frequent.&nbsp;<\/p>\n\n\n\n<p>Julai says she would sometimes eat ten clementine oranges in one sitting, and always added extra honey to her coffee in the morning, and to her yogurt as “dessert” after lunch and dinner every day.&nbsp;<\/p>\n\n\n\n<p>With the extra weight, Julai no longer felt comfortable with her body, and her self-esteem plummeted.&nbsp;<\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><em>“I gained a total of 10 kg. (22 lbs.) after 2 successive pregnancies. And I came to the point of not being comfortable about my weight anymore. I feel huge and bloated and when I look at the mirror, [and] my face is already very round.”<\/em><\/p><\/blockquote>\n\n\n\n<p>Back in her single, pre-kids days, Julai often went through unhealthy cycles of starving herself for days in order to lose weight for a party or event, and would then binge at the party and for days afterward.&nbsp;<\/p>\n\n\n\n<p>She knew that wasn’t going to cut it this time around, and that <strong>she needed to lose weight in a sustainable way.&nbsp;<\/strong><\/p>\n\n\n\n<p>So she tried exercising, spending 30-45 minutes on a stationary bike 4-5 days a week for a whole month&#8211;and <em>gained weight!<\/em>&nbsp;<\/p>\n\n\n\n<p>Julai knew a big reason for that was that the exercise increased her appetite, and she felt like she could eat however much she wanted because she was exercising.&nbsp;<\/p>\n\n\n\n<p>She was beside herself with frustration, and knew she had to make a bigger change to her diet&#8211;but she simply wasn’t sure how to do that.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>The Turning Point<\/strong><\/h3>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"500\" height=\"534\" src=\"https:\/\/avocadu.com\/wp-content\/uploads\/2021\/08\/Julai-Before-Image.jpg\" alt=\"Julai before weight loss\" class=\"wp-image-32363\" srcset=\"https:\/\/avocadu.com\/wp-content\/uploads\/2021\/08\/Julai-Before-Image.jpg 500w, https:\/\/avocadu.com\/wp-content\/uploads\/2021\/08\/Julai-Before-Image-281x300.jpg 281w, https:\/\/avocadu.com\/wp-content\/uploads\/2021\/08\/Julai-Before-Image-20x20.jpg 20w\" sizes=\"(max-width: 500px) 100vw, 500px\" \/><\/figure><\/div>\n\n\n\n<p>For Julai, her faith and her health were the biggest motivators that pushed her to finally make lasting changes to her diet and lifestyle&#8211;and that kick in the pants came in the form of what Julai felt was a sign from God.&nbsp;<\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><em>“I came across a homily of Fr. Dave (a Filipino priest who uploads his homily of the day on YouTube) where he talked about gluttony, and [he said] something about when we ask for something from God, we also have to do our part.<\/em><\/p><p><em>“And in that instant what came to mind was my health. I always pray to God that He gives my husband and me good health and long life, so we can take care of the kids that he entrusted to us for a long time. But am I doing my part?<\/em><\/p><p><em>The answer was a clear NO! I eat a LOT and I&nbsp;exercise very seldom.<\/em><\/p><p><em>Then after 2 or 3 days, I came across Avocadu and its 21-Day Fat Loss Challenge. I felt like God is really telling me something about making an action about my health and gaining weight.”<\/em><\/p><\/blockquote>\n\n\n\n<p>Still, she needed a little more of a push before she was ready to embark on her weight loss journey.<\/p>\n\n\n\n<p>Knowing that she really wanted to <strong>lose weight<\/strong> and <strong>take control of her health<\/strong>, Julai’s husband gave her a <a href=\"https:\/\/amzn.to\/3gG3JkG\" target=\"_blank\" rel=\"nofollow sponsored noreferrer noopener\">fitness tracking watch<\/a> and a <a href=\"https:\/\/amzn.to\/3kvfJqd\" target=\"_blank\" rel=\"nofollow sponsored noreferrer noopener\">digital scale<\/a> for Valentine’s Day.&nbsp;<\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><em>“The day the items arrived, I immediately unpacked and set the digital scale up.&nbsp;<\/em><\/p><p><em>“I weighed myself right away and the displayed result was a clear warning sign for me.&nbsp;<\/em><\/p><p><em>“The scale reads 65.3 kg. (143.9 lbs) and on the health app, there was a red word under my weight that says: OVERWEIGHT!<\/em><\/p><p><em>“This was the final push that made me decide to really do the 21-Day Fat Loss Challenge.”<\/em><\/p><\/blockquote>\n\n\n\n<p><strong>So Julai started her first round of the Challenge right away.&nbsp;<\/strong><\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Julai’s Weight Loss Journey<\/strong><\/h2>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"660\" height=\"425\" src=\"https:\/\/avocadu.com\/wp-content\/uploads\/2021\/08\/Julai-Before-and-After-min.png\" alt=\"Left: Julai before weight loss. Right: Julai after weight loss. Wearing same outfit in both. \" class=\"wp-image-32364\" srcset=\"https:\/\/avocadu.com\/wp-content\/uploads\/2021\/08\/Julai-Before-and-After-min.png 660w, https:\/\/avocadu.com\/wp-content\/uploads\/2021\/08\/Julai-Before-and-After-min-300x193.png 300w, https:\/\/avocadu.com\/wp-content\/uploads\/2021\/08\/Julai-Before-and-After-min-20x13.png 20w\" sizes=\"(max-width: 660px) 100vw, 660px\" \/><\/figure><\/div>\n\n\n\n<p>While Julai was excited to start the 21-Day Fat Loss Challenge, she was worried she wouldn’t make it all the way through the program.&nbsp;<\/p>\n\n\n\n<p>She was especially concerned about <em>only eating food from the approved foods list<\/em>, since she couldn’t fathom the idea of denying herself food.<\/p>\n\n\n\n<p>Her husband was also skeptical, and wasn’t sure she would make it to day twenty-one.&nbsp;<\/p>\n\n\n\n<p>But once she started, she could see results right away, and <strong>those fast results were what kept her going.&nbsp;<\/strong><\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><em>“I weigh myself everyday and the numbers are going down. And it gives me the motivation to keep going. It gives me the feeling that I can do it!”<\/em><\/p><\/blockquote>\n\n\n\n<p>Suddenly, eating wasn’t just about consuming food simply because it was there&#8211;it was about <em>feeding her body, and fueling her goals and lifestyle.&nbsp;<\/em><\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Julai’s On-Scale Victories<\/strong><\/h3>\n\n\n\n<p>When she started the 21-Day Fat Loss Challenge, Julai weighed 65 kg, or 143 lbs.&nbsp;<\/p>\n\n\n\n<p>She lost <em>10 lbs in her first round<\/em> of the Challenge, and that’s with skipping the first two days (which involve fasting) because she was breastfeeding.&nbsp;&nbsp;<\/p>\n\n\n\n<p>But she’s not done yet!&nbsp;<\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><em>“I am currently doing round 2 because I want to lose 8-13 more pounds. I want to be in the 119 – 123 lbs range, a healthy weight for my height and age.”<\/em><\/p><\/blockquote>\n\n\n\n<p>The 21-Day Fat Loss Challenge is designed to be repeated as many times as you need in order to reach your goal weight, and some of our members have even turned the Challenge into a lifestyle diet, with many members losing 100+ lbs.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Julai’s Off-Scale Wins<\/strong><\/h3>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"500\" height=\"722\" src=\"https:\/\/avocadu.com\/wp-content\/uploads\/2021\/08\/Julai-After-1.jpg\" alt=\"Julai round 2 before image\" class=\"wp-image-32366\" srcset=\"https:\/\/avocadu.com\/wp-content\/uploads\/2021\/08\/Julai-After-1.jpg 500w, https:\/\/avocadu.com\/wp-content\/uploads\/2021\/08\/Julai-After-1-208x300.jpg 208w, https:\/\/avocadu.com\/wp-content\/uploads\/2021\/08\/Julai-After-1-14x20.jpg 14w\" sizes=\"(max-width: 500px) 100vw, 500px\" \/><\/figure><\/div>\n\n\n\n<p>Julai is finally feeling more confident in her clothes, and is no longer embarrassed when seeing herself in a mirror.<\/p>\n\n\n\n<p>She can’t believe how flat her stomach is, and she no longer feel like she has to “suck it in.”&nbsp;<\/p>\n\n\n\n<p>Even though she has lost just over 10 lbs, a big reason for her flatter belly is that the Challenge approved foods are great for <strong>reducing belly bloat<\/strong>.<\/p>\n\n\n\n<p>Although she used to think her eating habits were pretty healthy, Julai only realized after she started the 21-Day Fat Loss Challenge that she was eating way more than she should&#8211;<em>often eating 2-3 more servings at each meal than she really needed<\/em>.<\/p>\n\n\n\n<p>She also realized during the Challenge that she was eating way more carbs and sugar than was healthy.&nbsp;&nbsp;<\/p>\n\n\n\n<p>But even more important than her improved appearance and diet are the emotional and mental benefits she’s gained from completing her first round of the Challenge.&nbsp;<\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><em>“My pants are all loose now! But the most important positive change I experience is the knowledge that I am capable of self discipline and self control when it comes to food.&nbsp;<\/em><\/p><p><em>“Because all my life, I had the belief that I don’t have discipline and control over food. And I am now more intentional and more present when I eat.&nbsp;<\/em><\/p><p><em>“Before, I [would] just eat without focusing on the food. I even watch[ed] videos while eating.&nbsp;<\/em><\/p><p><em>“But now, I am more present and thinking about my food when I eat, and thinking about the right portion size, etc.”<\/em><\/p><\/blockquote>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What’s Next for Julai?<\/strong><\/h2>\n\n\n\n<p>Julai still has a bit more weight to lose, but she’s already changed her whole lifestyle for the better.<\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><em>“[A]fter the challenge, I am definitely NOT going back to my old eating habits, because I don’t want to put the result of the Challenge to waste.&nbsp;<\/em><\/p><p><em>“I want to maintain my weight by eating more healthy foods and by doing exercise constantly, be it walking or indoor biking.”<\/em><\/p><\/blockquote>\n\n\n\n<p>Julai knows she made the right decision with improving her lifestyle and changing her eating habits; and the 21-Fat Loss Challenge was the perfect program to help her reach her goals, because she got fast results along with lasting health and lifestyle improvements that are easy to continue.&nbsp;<\/p>\n\n\n\n<p>And for those of you wondering if the 21-Day Fat Loss Challenge is right for you, here’s a message from Julai:<\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>“<em>My advice is to go for it! Avocadu 21-Day fat loss challenge is legit! It works!&nbsp;<\/em><\/p><p><em>“And please don’t underestimate yourself like I did to myself.&nbsp;<\/em><\/p><p><em>“Believe that you can do it and you will! The only thing you will lose in doing this challenge is your extra weight.”<\/em><\/p><\/blockquote>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What is the 21-Day Fat Loss Challenge?<\/strong><\/h2>\n\n\n\n<p>If you’re like July and have struggled to lose weight, constantly battle food cravings, and exercise just doesn’t work for you, I can almost guarantee your hormone levels are out of balance—especially insulin.<\/p>\n\n\n\n<p>That makes it incredibly hard to lose weight, even if you’re burning more calories than you eat.&nbsp;<\/p>\n\n\n\n<p>Fortunately, you can rebalance your insulin levels (and other hormones) by reducing or eliminating carbs and sugars from your diet—which is exactly what the<a href=\"https:\/\/21dayfatlosschallenge.com\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\"> 21-Day Fat Loss Challenge<\/a> was designed to do.<\/p>\n\n\n\n<p>We created our<a href=\"https:\/\/21dayfatlosschallenge.com\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\"> 21-Day Fat Loss Challenge<\/a> for people just like you—people who have tried everything under the sun, but just can’t shed the weight or keep it off.<\/p>\n\n\n\n<p>The Challenge comes with step-by-step instructions for all twenty-one days, so there is no guesswork involved.<\/p>\n\n\n\n<p>And don’t worry—you won’t have to count calories, and you don’t even need to exercise to<strong> lose up to 21 lbs in just 21 days!<\/strong><\/p>\n\n\n\n<p>If you have more weight to lose, the<a href=\"https:\/\/21dayfatlosschallenge.com\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\"> 21-Day Fat Loss Challenge<\/a> can be repeated as many times as you want (at no extra cost), so you can reach your goal weight with one simple plan.<\/p>\n\n\n\n<p>The best part? Along with <em>rebalancing your hormones, you’ll also be healing your gut, fueling your body with nutritious foods, and kicking your sugar addiction to the curb<\/em>—so you can lose weight effortlessly, and keep it off!<\/p>\n\n\n\n<p>Plus, our <strong>Facebook support group<\/strong> has over 4,000 members—so you will have access to tons of support, tips, recipes, and endless encouragement!<\/p>\n\n\n\n<p>If you&#8217;d like to check out the program that Julai used to lose 10 pounds in just 19 days (all while she was breastfeeding!!), we&#8217;d love to have you on board!<\/p>\n\n\n\n<p><a href=\"https:\/\/21dayfatlosschallenge.com\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\"><strong>Click here to get started with YOUR 21-Day Fat Loss Challenge today!<\/strong><\/a><\/p>\n\n\n\n<p>And if you loved this story, or have questions about Julai’s weight loss journey, please leave us a comment below!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Weight changes are common as you get older, and are caused by all sorts of things, like hormonal changes, stress, lifestyle changes, and etc.&nbsp; And you know what major change involves pretty much every major change we just listed?&nbsp; Going through pregnancy, breastfeeding, and parenthood! You’re supposed to gain some weight during pregnancy in order&#8230;<\/p>\n","protected":false},"author":18,"featured_media":32370,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_kad_blocks_custom_css":"","_kad_blocks_head_custom_js":"","_kad_blocks_body_custom_js":"","_kad_blocks_footer_custom_js":"","_kad_post_transparent":"","_kad_post_title":"","_kad_post_layout":"","_kad_post_sidebar_id":"","_kad_post_content_style":"","_kad_post_vertical_padding":"","_kad_post_feature":"","_kad_post_feature_position":"","_kad_post_header":false,"_kad_post_footer":false,"footnotes":""},"categories":[115,25],"tags":[78,53],"taxonomy_info":{"category":[{"value":115,"label":"Testimonials"},{"value":25,"label":"Weight Loss"}],"post_tag":[{"value":78,"label":"21-day weight loss challenge"},{"value":53,"label":"testimonial"}]},"featured_image_src_large":["https:\/\/avocadu.com\/wp-content\/uploads\/2021\/08\/Julai-Featured-min.png",500,278,false],"author_info":{"display_name":"Cathy Dean","author_link":"https:\/\/avocadu.com\/author\/cathydean\/"},"comment_info":2,"category_info":[{"term_id":115,"name":"Testimonials","slug":"testimonials","term_group":0,"term_taxonomy_id":115,"taxonomy":"category","description":"Success stories from the 21-Day Fat Loss Challenge","parent":0,"count":5,"filter":"raw","cat_ID":115,"category_count":5,"category_description":"Success stories from the 21-Day Fat Loss Challenge","cat_name":"Testimonials","category_nicename":"testimonials","category_parent":0},{"term_id":25,"name":"Weight Loss","slug":"weight-loss","term_group":0,"term_taxonomy_id":25,"taxonomy":"category","description":"","parent":0,"count":154,"filter":"raw","cat_ID":25,"category_count":154,"category_description":"","cat_name":"Weight Loss","category_nicename":"weight-loss","category_parent":0}],"tag_info":[{"term_id":78,"name":"21-day weight loss challenge","slug":"21-day-weight-loss-challenge","term_group":0,"term_taxonomy_id":78,"taxonomy":"post_tag","description":"","parent":0,"count":2,"filter":"raw"},{"term_id":53,"name":"testimonial","slug":"testimonial","term_group":0,"term_taxonomy_id":53,"taxonomy":"post_tag","description":"","parent":0,"count":4,"filter":"raw"}],"_links":{"self":[{"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/posts\/32350"}],"collection":[{"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/users\/18"}],"replies":[{"embeddable":true,"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/comments?post=32350"}],"version-history":[{"count":13,"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/posts\/32350\/revisions"}],"predecessor-version":[{"id":35140,"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/posts\/32350\/revisions\/35140"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/media\/32370"}],"wp:attachment":[{"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/media?parent=32350"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/categories?post=32350"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/avocadu.com\/wp-json\/wp\/v2\/tags?post=32350"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}